PurvaGC.org
#+TITLE: Green Card Planner
#+AUTHOR: Alok Arya (buntyalok06@gmail.com)
#+CO-AUTHOR: Purva Gupta (purva4385@gmail.com)
#+TODO: TODO IN-PROGRESS REVIEW | DONE
#+TAGS:
#+STARTUP: indent content
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-bigblow.setup

* EB2 - NIW

** Steps

*** DONE Upload your CV and make a Google scholar profile.

*** IN-PROGRESS Upload your summary of contributions; revise as needed.

*** TODO Upload a list of potential reccomenders; contact & confirm.

*** TODO Receive draft of reference letters.

*** TODO Review/review the letter drafts.

*** TODO send the letters to the recommenders to be signed.

*** TODO Upload all the signed letters.

*** TODO Lawyers will draft the petition letter.

*** TODO Fillout the questionaire tab or forms.

*** TODO Review/revise and finalize the petition letter. 

*** TODO Print out and prepare supporting documents. 

*** TODO Mail lawyers the supporting documents and remaining fee(s).

*** TODO Lawyers will organize our exhbits and file the case.

*** TODO Receive receipt notice within 7-30 days.

** TODO Degree evaluation for PhD
Need to get a document by document evaluation done.

*** Agencies (Recommended by Lawyers)
All these agencies are part of [[https://www.naces.org/members][NACES]]
- A2Z Evaluations, LLC
  - Fee - $195
  - [[https://www.a2zeval.com/category_s/23.htm][Link]]
  - Requirements - Mail original official transcript and degree certificate 
- World Education Services, Inc.
  Fee - $145
  Requirements
  - Degree certificate(Final or Provisional)
    Send clear and legible copy of this document to WES. Do not send
    your original document.
  - Mark Sheets/Statment of Marks
    University to send document directly in a sealed envelope that is
    signed or stamped across the back flap by the appropriate officer at
   the institution that coducted the examination.
- Academic Evaluation Services, Inc.
- Educational Credential Evaluators, Inc.
- Educational Perspectives, nfp
- Educational Records Evaluation Service, Inc.
- Evaluation Service, Inc.
- Foreign Academic Credential Service, Inc.
- Foundation for International Services, Inc.
- Global Credential Evaluators, Inc.
- Global Services Associates, Inc.
- International Academic Credential Evaluators, Inc.
- International Consultants of Delaware, Inc.
- International Education Evaluations, Inc.
- International Education Research Foundation, Inc.
- Center for Applied Research, Evaluation and Education, Inc.
- Josef Silny and Associates, Inc. International Education Consultants
- SpanTran: The Evaluation Company
- Transcript Research

*** Agencies (Recommended others)
- American evaluation & Translation service Inc.
  - [[http://www.aetsinternational.com][Link]]
  - Service: Educational Evaluation
  - Requirements: Copies of academic documents like diploma(degree
    certificates) and/or academic transcripts(indicating graduation date and
    major), Completed application form
  - Fee: $100 (10 days service)
  - Advantage: They don't need the institution or us to send 'official' copies.


** Degree 

** Official academic record
One of the 2
1. Official Transcript
2. Official letter from the Registrar stating
   - Degree earned.
   - your dates of attendance.
   - your area of concentration of study.
   - date you received your degree.

* Knowledge Base

Q) Are there any travel restrictions while on J-1 visa after filing I-140?

A) It is generally advised that are in a non-immigrant visa status
   that does not allow immigrant intent (such as your J-1 visa) against
   traveling outside of the U.S. after filing the I-140 in order to avoid
   potential issues with re-entry into the U.S. since, by filing the I-140,
   you will be demonstrating your intent to immigrate to some extent.


