PurvaGC.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-10-12 Sat 14:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Green Card Planner</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Alok Arya (buntyalok06@gmail.com)" />

<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/bigblow/css/hideshow.css"/>









</head>
<body>
<div id="content">
<h1 class="title">Green Card Planner</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org364cda0">1. EB2 - NIW</a>
<ul>
<li><a href="#org9d03de1">1.1. Steps</a>
<ul>
<li><a href="#orgff1fcec">1.1.1. <span class="done DONE">DONE</span> Upload your CV and make a Google scholar profile.</a></li>
<li><a href="#orgb01efe0">1.1.2. <span class="todo IN_PROGRESS">IN-PROGRESS</span> Upload your summary of contributions; revise as needed.</a></li>
<li><a href="#orgfc3fef0">1.1.3. <span class="todo TODO">TODO</span> Upload a list of potential reccomenders; contact &amp; confirm.</a></li>
<li><a href="#orgd9197e6">1.1.4. <span class="todo TODO">TODO</span> Receive draft of reference letters.</a></li>
<li><a href="#orgc0c1189">1.1.5. <span class="todo TODO">TODO</span> Review/review the letter drafts.</a></li>
<li><a href="#orgab86af9">1.1.6. <span class="todo TODO">TODO</span> send the letters to the recommenders to be signed.</a></li>
<li><a href="#orgf4ea4d8">1.1.7. <span class="todo TODO">TODO</span> Upload all the signed letters.</a></li>
<li><a href="#org6cfd6b6">1.1.8. <span class="todo TODO">TODO</span> Lawyers will draft the petition letter.</a></li>
<li><a href="#org3b805ea">1.1.9. <span class="todo TODO">TODO</span> Fillout the questionaire tab or forms.</a></li>
<li><a href="#org236b792">1.1.10. <span class="todo TODO">TODO</span> Review/revise and finalize the petition letter.</a></li>
<li><a href="#orga23e6c7">1.1.11. <span class="todo TODO">TODO</span> Print out and prepare supporting documents.</a></li>
<li><a href="#org7160f3b">1.1.12. <span class="todo TODO">TODO</span> Mail lawyers the supporting documents and remaining fee(s).</a></li>
<li><a href="#orgbdfe4d4">1.1.13. <span class="todo TODO">TODO</span> Lawyers will organize our exhbits and file the case.</a></li>
<li><a href="#orgb800a10">1.1.14. <span class="todo TODO">TODO</span> Receive receipt notice within 7-30 days.</a></li>
</ul>
</li>
<li><a href="#orgba66986">1.2. <span class="todo TODO">TODO</span> Degree evaluation for PhD</a>
<ul>
<li><a href="#org4927957">1.2.1. Agencies (Recommended by Lawyers)</a></li>
<li><a href="#orgf21cff0">1.2.2. Agencies (Recommended others)</a></li>
</ul>
</li>
<li><a href="#org255654f">1.3. Degree</a></li>
<li><a href="#org09848fe">1.4. Official academic record</a></li>
</ul>
</li>
<li><a href="#orga60b212">2. Knowledge Base</a></li>
</ul>
</div>
</div>

<div id="outline-container-org364cda0" class="outline-2">
<h2 id="org364cda0"><span class="section-number-2">1</span> EB2 - NIW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org9d03de1" class="outline-3">
<h3 id="org9d03de1"><span class="section-number-3">1.1</span> Steps</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgff1fcec" class="outline-4">
<h4 id="orgff1fcec"><span class="section-number-4">1.1.1</span> <span class="done DONE">DONE</span> Upload your CV and make a Google scholar profile.</h4>
</div>

<div id="outline-container-orgb01efe0" class="outline-4">
<h4 id="orgb01efe0"><span class="section-number-4">1.1.2</span> <span class="todo IN_PROGRESS">IN-PROGRESS</span> Upload your summary of contributions; revise as needed.</h4>
</div>

<div id="outline-container-orgfc3fef0" class="outline-4">
<h4 id="orgfc3fef0"><span class="section-number-4">1.1.3</span> <span class="todo TODO">TODO</span> Upload a list of potential reccomenders; contact &amp; confirm.</h4>
</div>

<div id="outline-container-orgd9197e6" class="outline-4">
<h4 id="orgd9197e6"><span class="section-number-4">1.1.4</span> <span class="todo TODO">TODO</span> Receive draft of reference letters.</h4>
</div>

<div id="outline-container-orgc0c1189" class="outline-4">
<h4 id="orgc0c1189"><span class="section-number-4">1.1.5</span> <span class="todo TODO">TODO</span> Review/review the letter drafts.</h4>
</div>

<div id="outline-container-orgab86af9" class="outline-4">
<h4 id="orgab86af9"><span class="section-number-4">1.1.6</span> <span class="todo TODO">TODO</span> send the letters to the recommenders to be signed.</h4>
</div>

<div id="outline-container-orgf4ea4d8" class="outline-4">
<h4 id="orgf4ea4d8"><span class="section-number-4">1.1.7</span> <span class="todo TODO">TODO</span> Upload all the signed letters.</h4>
</div>

<div id="outline-container-org6cfd6b6" class="outline-4">
<h4 id="org6cfd6b6"><span class="section-number-4">1.1.8</span> <span class="todo TODO">TODO</span> Lawyers will draft the petition letter.</h4>
</div>

<div id="outline-container-org3b805ea" class="outline-4">
<h4 id="org3b805ea"><span class="section-number-4">1.1.9</span> <span class="todo TODO">TODO</span> Fillout the questionaire tab or forms.</h4>
</div>

<div id="outline-container-org236b792" class="outline-4">
<h4 id="org236b792"><span class="section-number-4">1.1.10</span> <span class="todo TODO">TODO</span> Review/revise and finalize the petition letter.</h4>
</div>

<div id="outline-container-orga23e6c7" class="outline-4">
<h4 id="orga23e6c7"><span class="section-number-4">1.1.11</span> <span class="todo TODO">TODO</span> Print out and prepare supporting documents.</h4>
</div>

<div id="outline-container-org7160f3b" class="outline-4">
<h4 id="org7160f3b"><span class="section-number-4">1.1.12</span> <span class="todo TODO">TODO</span> Mail lawyers the supporting documents and remaining fee(s).</h4>
</div>

<div id="outline-container-orgbdfe4d4" class="outline-4">
<h4 id="orgbdfe4d4"><span class="section-number-4">1.1.13</span> <span class="todo TODO">TODO</span> Lawyers will organize our exhbits and file the case.</h4>
</div>

<div id="outline-container-orgb800a10" class="outline-4">
<h4 id="orgb800a10"><span class="section-number-4">1.1.14</span> <span class="todo TODO">TODO</span> Receive receipt notice within 7-30 days.</h4>
</div>
</div>

<div id="outline-container-orgba66986" class="outline-3">
<h3 id="orgba66986"><span class="section-number-3">1.2</span> <span class="todo TODO">TODO</span> Degree evaluation for PhD</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Need to get a document by document evaluation done.
</p>
</div>

<div id="outline-container-org4927957" class="outline-4">
<h4 id="org4927957"><span class="section-number-4">1.2.1</span> Agencies (Recommended by Lawyers)</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
All these agencies are part of <a href="https://www.naces.org/members">NACES</a>
</p>
<ul class="org-ul">
<li>A2Z Evaluations, LLC
<ul class="org-ul">
<li>Fee - $195</li>
<li><a href="https://www.a2zeval.com/category_s/23.htm">Link</a></li>
<li>Requirements - Mail original official transcript and degree certificate</li>
</ul></li>
<li>World Education Services, Inc.
Fee - $145
Requirements
<ul class="org-ul">
<li>Degree certificate(Final or Provisional)
Send clear and legible copy of this document to WES. Do not send
your original document.</li>
<li>Mark Sheets/Statment of Marks
 University to send document directly in a sealed envelope that is
 signed or stamped across the back flap by the appropriate officer at
the institution that coducted the examination.</li>
</ul></li>
<li>Academic Evaluation Services, Inc.</li>
<li>Educational Credential Evaluators, Inc.</li>
<li>Educational Perspectives, nfp</li>
<li>Educational Records Evaluation Service, Inc.</li>
<li>Evaluation Service, Inc.</li>
<li>Foreign Academic Credential Service, Inc.</li>
<li>Foundation for International Services, Inc.</li>
<li>Global Credential Evaluators, Inc.</li>
<li>Global Services Associates, Inc.</li>
<li>International Academic Credential Evaluators, Inc.</li>
<li>International Consultants of Delaware, Inc.</li>
<li>International Education Evaluations, Inc.</li>
<li>International Education Research Foundation, Inc.</li>
<li>Center for Applied Research, Evaluation and Education, Inc.</li>
<li>Josef Silny and Associates, Inc. International Education Consultants</li>
<li>SpanTran: The Evaluation Company</li>
<li>Transcript Research</li>
</ul>
</div>
</div>

<div id="outline-container-orgf21cff0" class="outline-4">
<h4 id="orgf21cff0"><span class="section-number-4">1.2.2</span> Agencies (Recommended others)</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>American evaluation &amp; Translation service Inc.
<ul class="org-ul">
<li><a href="http://www.aetsinternational.com">Link</a></li>
<li>Service: Educational Evaluation</li>
<li>Requirements: Copies of academic documents like diploma(degree
certificates) and/or academic transcripts(indicating graduation date and
major), Completed application form</li>
<li>Fee: $100 (10 days service)</li>
<li>Advantage: They don't need the institution or us to send 'official' copies.</li>
</ul></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org255654f" class="outline-3">
<h3 id="org255654f"><span class="section-number-3">1.3</span> Degree</h3>
</div>

<div id="outline-container-org09848fe" class="outline-3">
<h3 id="org09848fe"><span class="section-number-3">1.4</span> Official academic record</h3>
<div class="outline-text-3" id="text-1-4">
<p>
One of the 2
</p>
<ol class="org-ol">
<li>Official Transcript</li>
<li>Official letter from the Registrar stating
<ul class="org-ul">
<li>Degree earned.</li>
<li>your dates of attendance.</li>
<li>your area of concentration of study.</li>
<li>date you received your degree.</li>
</ul></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orga60b212" class="outline-2">
<h2 id="orga60b212"><span class="section-number-2">2</span> Knowledge Base</h2>
<div class="outline-text-2" id="text-2">
<p>
Q) Are there any travel restrictions while on J-1 visa after filing I-140?
</p>

<p>
A) It is generally advised that are in a non-immigrant visa status
   that does not allow immigrant intent (such as your J-1 visa) against
   traveling outside of the U.S. after filing the I-140 in order to avoid
   potential issues with re-entry into the U.S. since, by filing the I-140,
   you will be demonstrating your intent to immigrate to some extent.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alok Arya (buntyalok06@gmail.com)</p>
<p class="date">Created: 2019-10-12 Sat 14:24</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
